[
    {
        "tweet": "\"Unshakeable in faith, St. Peter—the 'Rock'. His narrative is a testament to transforming strength & steadfastness. From a humble fisherman to the First Pope, his journey is a tribute to the power of faith, redemption & Divine callings.🎣⛪️ #StPeter #FaithJourney #Inspiration\"",
        "image": "images/tweet_1.png",
        "status": "used"
    },
    {
        "tweet": "\"St. Peter, a humble fisherman chosen by Jesus himself, a testament to the power of faith! He walked on water, held the keys to the Kingdom, and our first Pope. His story shows that greatness lies not in the status we are born with, but in our bonds with God! #SaintPeter #faith 🙏⭐️🌊\"",
        "image": "images/tweet_2.png",
        "status": "used"
    },
    {
        "tweet": "\"Galilean Fisherman to 'The Rock' of the Church! 🎣⛪️ St. Peter, a testament of transformation through faith. His life shows us how humility, repentance & immense love for Jesus can elevate a common man to an extraordinary #disciple. Let's follow his lessons, one act of faith at a time! 🙏 #StPeter #Christianity.\"",
        "image": "images/tweet_3.png",
        "status": "used"
    },
    {
        "tweet": "\"From fisherman to 'the Rock', St. Peter's journey of faith is an inspiration to all. He's proof that passion can overcome doubt. He stumbled, fell, but always rose – a testament to human resilience. 🕊️ Let's embrace his teachings of faith, redemption, and unwavering love! #StPeter #Faith #TrustInGod\"",
        "image": "images/tweet_4.png",
        "status": "used"
    },
    {
        "tweet": "1/5 \"Thinking about St. Peter today, a humble fisherman who walked on water, boldly confessed his faith, and became the 'rock' on which the Church was built! #FaithJourney🙏 #ChristianHeroes💪\"\n\n2/5 \"Did you know St. Peter was initially called Simon? Jesus saw his faith and named him 'Peter' meaning 'rock'. Talk about a divine promotion! #PeterTheRock 🪨 #FunFactFriday\"\n\n3/5 \"When times get tough, remember St. Peter. He denied Jesus three times out of fear, yet became one of Christianity's bravest leaders. There's redemption in our mistakes, never forget that. #MotivationMonday💪🙏\"\n\n4/5 \"On this day, let's celebrate the #FeastOfStPeter. From Normal to Supernatural, Peter’s story reminds us that any life yielded to Christ can be transformed. Miracles are born from faith! 🌊🏃\"\n\n5/5 \"St. Peter's legacy is a testament to the power of faith and forgiveness. Though he was imperfect, his love for Christ made him a beacon of hope to many. Let's strive to live by his example! #WednesdayWisdom ✨\"",
        "image": "images/tweet_5.png",
        "status": "used"
    },
    {
        "tweet": "Embracing humility amidst greatness, St. John the Baptist illuminated the path of righteousness. Baptizing in the river of transformation, his life is a reflection of devoted service to God. Let's strive to be as humble and dedicated in our faith. #StJohnTheBaptist #FaithJourney 🙏💦✨",
        "image": "images/St. John the Baptist_1.png",
        "status": "new"
    },
    {
        "tweet": "\"Trailblazer, fearless preacher, humble servant - St. John the Baptist, embodies these divine virtues. His voice, echoing in the wilderness, heralded the coming of the Messiah. May his courage inspire us to speak truth even in adversity. 🏞️✝️ #StJohnTheBaptist #ChristianLife\"",
        "image": "images/St. John the Baptist_2.png",
        "status": "new"
    },
    {
        "tweet": "\"Going against conformity, St. John the Baptist, cloaked in his humble attire, roared his call for repentance like no other. Baptizing Jesus himself, his life was a symphony of faith and dedication. #StJohnTheBaptist #VoiceInTheWilderness #FaithBeyondOrdinary\"",
        "image": "images/St. John the Baptist_3.png",
        "status": "new"
    },
    {
        "tweet": "\"Called to preach even before his birth, St. John the Baptist was a figure of humility, honesty, and valor. His loving devotion to God led him to pave the way for Jesus himself. \"He must increase, but I must decrease\" John 3:30, he says, encapsulating his call to witness for Christ. #StJohnTheBaptist #Christianity #Faith🙏🕊️✝️\"",
        "image": "images/St. John the Baptist_4.png",
        "status": "new"
    },
    {
        "tweet": "1/5 \"Embracing humility in the Jordan, St. John the Baptist paved the way for the Light of the World. As the last prophet, his voice in the wilderness echoes still - calling us to reflection, repentance, and readiness. #Christianity #StJohnTheBaptist\"\n\n2/5 \"St. John the Baptist - A solitary figure draped in camel's hair, yet his message roared like a lion in the wilderness, preparing hearts for the Savior. His life is a testament to the power of faith and sacrifice. #LivingFaith #ChristianIcons\"\n\n3/5 \"Believing before seeing – that’s St. John the Baptist. The wild prophet, who leaped for joy while still in his mother's womb, reminds us of the power of unseen faith. His life, an authentic call to prepare the way of the Lord! #FaithUnseen #StJohnTheBaptist\"\n\n4/5 \"A voice in the desert, yes but also a lamp leading the way. St. John the Baptist, an unyielding beacon, showing the path to Jesus. His courage and dedication to truth, inspire us to keep shining in our own corners of the world. #Courage #ChristianLeadership\"\n\n5/5 \"The fiery faith of St. John the Baptist, who carried out his mission with unflinching bravery, encourages us to stand for our convictions and proclaim our faith without fear. #FearlessFaith #StrengthInBelief #StJohnTheBaptist\"",
        "image": "images/St. John the Baptist_5.png",
        "status": "new"
    }
]